In [1]:
pip install mysql

Collecting mysqlNote: you may need to restart the kernel to use updated packages.

  Downloading mysql-0.0.2.tar.gz (1.9 kB)
Collecting mysqlclient
  Downloading mysqlclient-2.0.3-cp36-cp36m-win_amd64.whl (178 kB)
Building wheels for collected packages: mysql
  Building wheel for mysql (setup.py): started
  Building wheel for mysql (setup.py): finished with status 'done'
  Created wheel for mysql: filename=mysql-0.0.2-py3-none-any.whl size=1246 sha256=6497b7c4bfd8052153d07480fc9a1eff6e2781a993ddec9f69ad12d510366ca6
  Stored in directory: c:\users\sys\appdata\local\pip\cache\wheels\2c\dd\61\3bd68e4b604042bfd0aa0c74d9961841c04db834181bf4fe1a
Successfully built mysql
Installing collected packages: mysqlclient, mysql
Successfully installed mysql-0.0.2 mysqlclient-2.0.3

WARNING: You are using pip version 20.3.3; however, version 21.0.1 is available.
You should consider upgrading via the 'c:\users\sys\appdata\local\programs\python\python36\python.exe -m pip install --upgrade pip' command.

In [9]:
# importing required libraries
import mysql.connector as sql
import pandas as pd

In [2]:
# creating connection
db = sql.connect(host = 'localhost', user = 'root',passwd = 'dbmsadmin',database = 'company',
                 auth_plugin='mysql_native_password')

In [10]:
# create data as pandas dataframe
query = "select * from customers"
data = pd.read_sql(query, db)

In [11]:
# print the data
data.head()

  CustID custName    city  postalCode  country
0      1    Rahul  kanpur        2345    India
1      2  Alfreds  berlin        1229  Germany
2      3  Antonio  London        7643       UK